---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.IndexLine.Index1
source: html/511531f1-c74b-ea94-ea4b-d91f7ea45602.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexLine.Index1 Property

The index of the line segment's second vertex.

## Syntax (C#)
```csharp
public int Index1 { get; set; }
```